<a href="https://colab.research.google.com/github/Diptyregar456/Python/blob/main/DataFrame_with_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
df = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12]])
df

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [ ]:
df.shape

(3, 4)

In [ ]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
df.loc[1]

0    5
1    6
2    7
3    8
Name: 1, dtype: int64

**selecting multiple values(row,column)**

In [ ]:
df1 = pd.DataFrame([['ab','b','c','d'],['aa','bb','cc','dd'],['aaa','bbb','ccc','ddd']])
df1

     0    1    2    3
0   ab    b    c    d
1   aa   bb   cc   dd
2  aaa  bbb  ccc  ddd

In [ ]:
df1.shape

(3, 4)

In [ ]:
df1.values

array([['ab', 'b', 'c', 'd'],
       ['aa', 'bb', 'cc', 'dd'],
       ['aaa', 'bbb', 'ccc', 'ddd']], dtype=object)

In [ ]:
df1.loc[2]

0    aaa
1    bbb
2    ccc
3    ddd
Name: 2, dtype: object

In [ ]:
df1.values

array([['ab', 'b', 'c', 'd'],
       ['aa', 'bb', 'cc', 'dd'],
       ['aaa', 'bbb', 'ccc', 'ddd']], dtype=object)

In [ ]:
df1.value_counts

<bound method DataFrame.value_counts of      0    1    2    3
0   ab    b    c    d
1   aa   bb   cc   dd
2  aaa  bbb  ccc  ddd>

In [ ]:
df1.shift

<bound method DataFrame.shift of      0    1    2    3
0   ab    b    c    d
1   aa   bb   cc   dd
2  aaa  bbb  ccc  ddd>

In [ ]:
df1.iloc[0,2]
df1.loc[0:2]

     0    1    2    3
0   ab    b    c    d
1   aa   bb   cc   dd
2  aaa  bbb  ccc  ddd

In [ ]:
df.loc[[1,2],[0,2]]

   0   2
1  5   7
2  9  11

In [ ]:
df1.loc[[1,2],[0,2]]

     0    2
1   aa   cc
2  aaa  ccc

In [ ]:
df2 = pd.DataFrame(np.random.rand(5,4))
df2

          0         1         2         3
0  0.245270  0.653254  0.385264  0.411723
1  0.730249  0.912107  0.152075  0.798471
2  0.625085  0.599291  0.782281  0.995477
3  0.798141  0.479899  0.474078  0.711025
4  0.841059  0.844456  0.777177  0.946572

In [ ]:
df2 = pd.DataFrame(np.random.randn(3,4))
df2

          0         1         2         3
0  0.689328 -0.319742 -2.081081 -1.449617
1  0.168739 -0.206847 -2.815514  0.462224
2 -0.389184 -1.526189  1.791478 -0.548145

**can set the columns and index**

In [ ]:
import pandas as pd
import numpy as np
df3 = pd.DataFrame(np.random.randn(5,5), index=[1,2,3,4,5], columns=['a','b','c','d','e'])
df3

          a         b         c         d         e
1  1.244712  0.561304  0.167745  2.220507 -0.933699
2  2.253695 -2.096942  1.035844 -0.584018  0.357895
3 -1.659776  1.242335 -0.740277 -0.649774  1.137415
4 -0.638924  0.121689 -0.849551 -1.419412 -0.075959
5 -1.220691  0.409410 -0.500838 -1.246227 -0.543392

In [ ]:
print(df3.columns)

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [ ]:
df3.columns

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [ ]:
df3.loc[3]

a   -1.659776
b    1.242335
c   -0.740277
d   -0.649774
e    1.137415
Name: 3, dtype: float64

**ACCESS BASED ON CODITIONS**

In [ ]:
df3

          a         b         c         d         e
1  1.244712  0.561304  0.167745  2.220507 -0.933699
2  2.253695 -2.096942  1.035844 -0.584018  0.357895
3 -1.659776  1.242335 -0.740277 -0.649774  1.137415
4 -0.638924  0.121689 -0.849551 -1.419412 -0.075959
5 -1.220691  0.409410 -0.500838 -1.246227 -0.543392

In [ ]:
df3>0.2

       a      b      c      d      e
1   True   True  False   True  False
2   True  False   True  False   True
3  False   True  False  False   True
4  False  False  False  False  False
5  False   True  False  False  False

In [ ]:
df3[df3>0.2]

          a         b         c         d         e
1  1.244712  0.561304       NaN  2.220507       NaN
2  2.253695       NaN  1.035844       NaN  0.357895
3       NaN  1.242335       NaN       NaN  1.137415
4       NaN       NaN       NaN       NaN       NaN
5       NaN  0.409410       NaN       NaN       NaN

In [ ]:
df3

          a         b         c         d         e
1  1.244712  0.561304  0.167745  2.220507 -0.933699
2  2.253695 -2.096942  1.035844 -0.584018  0.357895
3 -1.659776  1.242335 -0.740277 -0.649774  1.137415
4 -0.638924  0.121689 -0.849551 -1.419412 -0.075959
5 -1.220691  0.409410 -0.500838 -1.246227 -0.543392

In [ ]:
df3 = pd.DataFrame(np.random.randn(5,5), index=[1,2,3,4,5],columns=['a','b','c','d','e'])
df3

          a         b         c         d         e
1  0.977747 -0.022137  0.525495  1.484386 -0.328592
2  0.086231 -0.119789  1.228792 -0.047197 -0.323713
3 -0.706940  0.224443 -0.022417  1.018886 -0.117056
4 -0.454714 -2.011569  0.411305 -1.173624  0.028862
5 -1.724431  2.305740  1.081487  0.953899  0.189846

In [ ]:
df3.drop('e', axis=1, inplace=True)
df3

          a         b         c         d
1  0.977747 -0.022137  0.525495  1.484386
2  0.086231 -0.119789  1.228792 -0.047197
3 -0.706940  0.224443 -0.022417  1.018886
4 -0.454714 -2.011569  0.411305 -1.173624
5 -1.724431  2.305740  1.081487  0.953899

**ADDING ROW TO DATA FRMAES**

In [ ]:
df3.append(pd.Series([0.001,0.002,0.003,0.004],name=6,index=[1,2,3,4]))
df3

          a         b         c         d
1  0.977747 -0.022137  0.525495  1.484386
2  0.086231 -0.119789  1.228792 -0.047197
3 -0.706940  0.224443 -0.022417  1.018886
4 -0.454714 -2.011569  0.411305 -1.173624
5 -1.724431  2.305740  1.081487  0.953899

In [ ]:
df3.reset_index()

   index         a         b         c         d
0      1  0.977747 -0.022137  0.525495  1.484386
1      2  0.086231 -0.119789  1.228792 -0.047197
2      3 -0.706940  0.224443 -0.022417  1.018886
3      4 -0.454714 -2.011569  0.411305 -1.173624
4      5 -1.724431  2.305740  1.081487  0.953899

In [ ]:
df3.reset_index(drop=True)

          a         b         c         d
0  0.977747 -0.022137  0.525495  1.484386
1  0.086231 -0.119789  1.228792 -0.047197
2 -0.706940  0.224443 -0.022417  1.018886
3 -0.454714 -2.011569  0.411305 -1.173624
4 -1.724431  2.305740  1.081487  0.953899

In [ ]:
df3.sort_index().reset_index(drop=True)

          a         b         c         d
0  0.977747 -0.022137  0.525495  1.484386
1  0.086231 -0.119789  1.228792 -0.047197
2 -0.706940  0.224443 -0.022417  1.018886
3 -0.454714 -2.011569  0.411305 -1.173624
4 -1.724431  2.305740  1.081487  0.953899

**READING CSV**

In [ ]:
import pandas as pd
#df = pd.read_csv("/content/iris.csv")
df

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

**READING CSV

> first upload csv file in the google colab.
write the code for upload the data in google colab
from google.colab import files
uploaded = files.upload()
after that the option there will be the option will show choose the file.
after that will reading the csv.
import pandas as pd
df(datafrmae) = pd.read_csv('filename)
after that will read the data carefully.

In [ ]:
from google.colab import files #here i uploaded the file csv 
uploaded =  files.upload()

Saving iris.csv to iris (2).csv

In [ ]:
import pandas as pd
df = pd.read_csv('iris.csv')

In [ ]:
#from ZipFile import ZipFile
#file_name = 'iris.zip'
#with ZipFile (file_name,'r')as zip:
  #zip.extractale()
  #print(done)

In [ ]:
import pandas as pd
df = pd.read_csv('iris.csv')
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [ ]:
df.shape

(150, 5)

In [ ]:
df.index

RangeIndex(start=0, stop=150, step=1)

In [ ]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [ ]:
df.head() #head will display the first 5 rows 
#so if we want to display the rows of data then will use head()
df.head(5)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
df.head() #first 5 rows

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
df.tail(5) #last 5 rows

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [ ]:
df[['sepal_length','sepal_width','species']] #shows specific columns of the data

     sepal_length  sepal_width    species
0             5.1          3.5     setosa
1             4.9          3.0     setosa
2             4.7          3.2     setosa
3             4.6          3.1     setosa
4             5.0          3.6     setosa
..            ...          ...        ...
145           6.7          3.0  virginica
146           6.3          2.5  virginica
147           6.5          3.0  virginica
148           6.2          3.4  virginica
149           5.9          3.0  virginica

[150 rows x 3 columns]

**ANALYZE THE DATAFRAME**

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [ ]:
df['sepal_length'].unique()

array([5.1, 4.9, 4.7, 4.6, 5. , 5.4, 4.4, 4.8, 4.3, 5.8, 5.7, 5.2, 5.5,
       4.5, 5.3, 7. , 6.4, 6.9, 6.5, 6.3, 6.6, 5.9, 6. , 6.1, 5.6, 6.7,
       6.2, 6.8, 7.1, 7.6, 7.3, 7.2, 7.7, 7.4, 7.9])

In [ ]:
df['sepal_width'].unique()

array([3.5, 3. , 3.2, 3.1, 3.6, 3.9, 3.4, 2.9, 3.7, 4. , 4.4, 3.8, 3.3,
       4.1, 4.2, 2.3, 2.8, 2.4, 2.7, 2. , 2.2, 2.5, 2.6])

In [ ]:
df['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [ ]:
df['petal_length'].unique()

array([1.4, 1.3, 1.5, 1.7, 1.6, 1.1, 1.2, 1. , 1.9, 4.7, 4.5, 4.9, 4. ,
       4.6, 3.3, 3.9, 3.5, 4.2, 3.6, 4.4, 4.1, 4.8, 4.3, 5. , 3.8, 3.7,
       5.1, 3. , 6. , 5.9, 5.6, 5.8, 6.6, 6.3, 6.1, 5.3, 5.5, 6.7, 6.9,
       5.7, 6.4, 5.4, 5.2])

In [ ]:
df['petal_width'].unique()

array([0.2, 0.4, 0.3, 0.1, 0.5, 0.6, 1.4, 1.5, 1.3, 1.6, 1. , 1.1, 1.8,
       1.2, 1.7, 2.5, 1.9, 2.1, 2.2, 2. , 2.4, 2.3])

In [ ]:
#value counts
df['petal_length'].value_counts()

1.5    14
1.4    12
5.1     8
4.5     8
1.3     7
1.6     7
5.6     6
4.0     5
4.9     5
4.7     5
4.8     4
1.7     4
4.4     4
4.2     4
5.0     4
4.1     3
5.5     3
4.6     3
6.1     3
5.7     3
3.9     3
5.8     3
1.2     2
1.9     2
6.7     2
3.5     2
5.9     2
6.0     2
5.4     2
5.3     2
3.3     2
4.3     2
5.2     2
6.3     1
1.1     1
6.4     1
3.6     1
3.7     1
3.0     1
3.8     1
6.6     1
6.9     1
1.0     1
Name: petal_length, dtype: int64

In [ ]:
df['species'].value_counts()

virginica     50
versicolor    50
setosa        50
Name: species, dtype: int64

In [ ]:
df['sepal_length'].value_counts()

5.0    10
6.3     9
5.1     9
6.7     8
5.7     8
5.5     7
5.8     7
6.4     7
6.0     6
4.9     6
6.1     6
5.4     6
5.6     6
6.5     5
4.8     5
7.7     4
6.9     4
5.2     4
6.2     4
4.6     4
7.2     3
6.8     3
4.4     3
5.9     3
6.6     2
4.7     2
7.6     1
7.4     1
4.3     1
7.9     1
7.3     1
7.0     1
4.5     1
5.3     1
7.1     1
Name: sepal_length, dtype: int64

In [ ]:
df['sepal_width'].value_counts()

3.0    26
2.8    14
3.2    13
3.4    12
3.1    12
2.9    10
2.7     9
2.5     8
3.5     6
3.8     6
3.3     6
2.6     5
2.3     4
3.6     3
2.4     3
2.2     3
3.7     3
3.9     2
4.2     1
4.1     1
4.4     1
2.0     1
4.0     1
Name: sepal_width, dtype: int64

In [ ]:
df[:10] #slicing k through u can get the row

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [ ]:
df[15:40]

    sepal_length  sepal_width  petal_length  petal_width species
15           5.7          4.4           1.5          0.4  setosa
16           5.4          3.9           1.3          0.4  setosa
17           5.1          3.5           1.4          0.3  setosa
18           5.7          3.8           1.7          0.3  setosa
19           5.1          3.8           1.5          0.3  setosa
20           5.4          3.4           1.7          0.2  setosa
21           5.1          3.7           1.5          0.4  setosa
22           4.6          3.6           1.0          0.2  setosa
23           5.1          3.3           1.7          0.5  setosa
24           4.8          3.4           1.9          0.2  setosa
25           5.0          3.0           1.6          0.2  setosa
26           5.0          3.4           1.6          0.4  setosa
27           5.2          3.5           1.5          0.2  setosa
28           5.2          3.4           1.4          0.2  setosa
29           4.7          3.2           1.6          0.2  setosa
30           4.8          3.1           1.6          0.2  setosa
31           5.4          3.4           1.5          0.4  setosa
32           5.2          4.1           1.5          0.1  setosa
33           5.5          4.2           1.4          0.2  setosa
34           4.9          3.1           1.5          0.1  setosa
35           5.0          3.2           1.2          0.2  setosa
36           5.5          3.5           1.3          0.2  setosa
37           4.9          3.1           1.5          0.1  setosa
38           4.4          3.0           1.3          0.2  setosa
39           5.1          3.4           1.5          0.2  setosa

In [ ]:
df[(df['petal_length']=='none')& (df['petal_width']=='june')]

Empty DataFrame
Columns: [sepal_length, sepal_width, petal_length, petal_width, species]
Index: []

In [ ]:
#describe
df.describe() #summary of the statistical calculations such as dispersion , mean, median,mode

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [ ]:
df['sepal_length'].describe()

count    150.000000
mean       5.843333
std        0.828066
min        4.300000
25%        5.100000
50%        5.800000
75%        6.400000
max        7.900000
Name: sepal_length, dtype: float64

In [ ]:
df['petal_length'].describe()

count    150.000000
mean       3.758667
std        1.764420
min        1.000000
25%        1.600000
50%        4.350000
75%        5.100000
max        6.900000
Name: petal_length, dtype: float64

In [ ]:
#rename columns
df.rename(columns={'sepal_length':'sepal_l'}, inplace=True)
df.head()

   sepal_l  sepal_width  petal_length  petal_width species
0      5.1          3.5           1.4          0.2  setosa
1      4.9          3.0           1.4          0.2  setosa
2      4.7          3.2           1.3          0.2  setosa
3      4.6          3.1           1.5          0.2  setosa
4      5.0          3.6           1.4          0.2  setosa

In [ ]:
#drop the columns
df.drop(labels={'species'}, axis=1, inplace=True)
df

     sepal_l  sepal_width  petal_length  petal_width
0        5.1          3.5           1.4          0.2
1        4.9          3.0           1.4          0.2
2        4.7          3.2           1.3          0.2
3        4.6          3.1           1.5          0.2
4        5.0          3.6           1.4          0.2
..       ...          ...           ...          ...
145      6.7          3.0           5.2          2.3
146      6.3          2.5           5.0          1.9
147      6.5          3.0           5.2          2.0
148      6.2          3.4           5.4          2.3
149      5.9          3.0           5.1          1.8

[150 rows x 4 columns]

In [ ]:
#sort the data
df['sepal_width'].value_counts().sort_values(ascending=False).head()

3.0    26
2.8    14
3.2    13
3.4    12
3.1    12
Name: sepal_width, dtype: int64

In [ ]:
df['sepal_width'].mean()

3.0540000000000007

In [ ]:
#grouping by values based on categories
import numpy as np
df.groupby(df['sepal_l']).agg(np.mean)

         sepal_width  petal_length  petal_width
sepal_l
4.3         3.000000      1.100000     0.100000
4.4         3.033333      1.333333     0.200000
4.5         2.300000      1.300000     0.300000
4.6         3.325000      1.325000     0.225000
4.7         3.200000      1.450000     0.200000
4.8         3.180000      1.580000     0.200000
4.9         2.866667      2.283333     0.533333
5.0         3.120000      1.840000     0.430000
5.1         3.477778      1.722222     0.400000
5.2         3.425000      2.075000     0.475000
5.3         3.700000      1.500000     0.200000
5.4         3.550000      2.033333     0.516667
5.5         2.842857      3.228571     0.900000
5.6         2.816667      4.200000     1.416667
5.7         3.100000      3.587500     1.100000
5.8         2.885714      4.071429     1.400000
5.9         3.066667      4.700000     1.700000
6.0         2.733333      4.650000     1.500000
6.1         2.850000      4.750000     1.416667
6.2         2.825000      4.750000     1.725000
6.3         2.855556      5.133333     1.811111
6.4         2.957143      5.157143     1.871429
6.5         3.000000      5.240000     1.900000
6.6         2.950000      4.500000     1.350000
6.7         3.050000      5.262500     1.962500
6.8         3.000000      5.400000     1.933333
6.9         3.125000      5.275000     2.050000
7.0         3.200000      4.700000     1.400000
7.1         3.000000      5.900000     2.100000
7.2         3.266667      5.966667     1.966667
7.3         2.900000      6.300000     1.800000
7.4         2.800000      6.100000     1.900000
7.6         3.000000      6.600000     2.100000
7.7         3.050000      6.600000     2.200000
7.9         3.800000      6.400000     2.000000

**DATA WRANGLING PROCESS
CONCATENATING, GROUPING, MERGING OF THE DATA.
CONCAT JOIN AND MERGE

In [ ]:
#CONCAT - ATTACHING TWO DATAFRAMES(THE SHAPE SHOULD MATCH)
#JOIN -- HAS A SEVERAL TYPE
'''
INNER
OUTER
LEFT
RIGHT
THE INDEXES MAY BE DIFFERENT'''

#MERGING -- COMBINE ALL TO 1 DATA FRAME

In [ ]:
df_1 = pd.DataFrame({'a':[1,2,3,4,5],'b':[11,1,2,3,4],'c':[21,22,23,24,23]})
df_1

   a   b   c
0  1  11  21
1  2   1  22
2  3   2  23
3  4   3  24
4  5   4  23

In [ ]:
df_2 = pd.DataFrame({'a':[31,32,33,34,35],'b':[41,4,5,3,2],'c':[1,2,3,4,5]})
df_2

    a   b  c
0  31  41  1
1  32   4  2
2  33   5  3
3  34   3  4
4  35   2  5

In [ ]:
pd.concat([df_1,df_2])

    a   b   c
0   1  11  21
1   2   1  22
2   3   2  23
3   4   3  24
4   5   4  23
0  31  41   1
1  32   4   2
2  33   5   3
3  34   3   4
4  35   2   5

In [ ]:
pd.concat([df_1,df_2],axis =1)

   a   b   c   a   b  c
0  1  11  21  31  41  1
1  2   1  22  32   4  2
2  3   2  23  33   5  3
3  4   3  24  34   3  4
4  5   4  23  35   2  5

In [ ]:
#merging 
one=pd.DataFrame({'col1': [1,2,3,4,5], 'col2': [11,12,13,14,15], 'shiv':[121,122,123,124,125]})
two=pd.DataFrame({'col1': [31,32,33,34,35], 'col2': [41,42,43,44,45], 'suki': [221,222,223,224,225]})

In [ ]:
pd.merge(one,two, how='inner', on=['col1', 'col2'])

Empty DataFrame
Columns: [col1, col2, shiv, suki]
Index: []

In [ ]:
pd.merge(one,two, how='outer', on=['col1', 'col2'])

   col1  col2   shiv   suki
0     1    11  121.0    NaN
1     2    12  122.0    NaN
2     3    13  123.0    NaN
3     4    14  124.0    NaN
4     5    15  125.0    NaN
5    31    41    NaN  221.0
6    32    42    NaN  222.0
7    33    43    NaN  223.0
8    34    44    NaN  224.0
9    35    45    NaN  225.0